In [1]:
import pandas as pd

In [35]:
temprature_df=pd.DataFrame({"City":["mumbai","delhi","banglore","hydrabad"],"temprature":[32,45,40,36]})
temprature_df

       City  temprature
0    mumbai          32
1     delhi          45
2  banglore          40
3  hydrabad          36

In [47]:
humidity_df=pd.DataFrame({"City":["delhi","mumbai","banglore","chennai"],"humidity":[68,65,75,70]})
humidity_df

       City  humidity
0     delhi        68
1    mumbai        65
2  banglore        75
3   chennai        70

In [40]:
temprature_df.append(humidity_df)

C:\Users\Alok\AppData\Local\Temp\ipykernel_10876\3676473608.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  temprature_df.append(humidity_df)

       City  temprature  humidity
0    mumbai        32.0       NaN
1     delhi        45.0       NaN
2  banglore        40.0       NaN
3  hydrabad        36.0       NaN
0     delhi         NaN      50.0
1    mumbai         NaN      55.0
2  banglore         NaN      42.0
3   chennai         NaN      70.0

In [41]:
pd.concat([temprature_df,humidity_df])

       City  temprature  humidity
0    mumbai        32.0       NaN
1     delhi        45.0       NaN
2  banglore        40.0       NaN
3  hydrabad        36.0       NaN
0     delhi         NaN      50.0
1    mumbai         NaN      55.0
2  banglore         NaN      42.0
3   chennai         NaN      70.0

In [42]:
pd.concat([temprature_df,humidity_df],ignore_index=True)

       City  temprature  humidity
0    mumbai        32.0       NaN
1     delhi        45.0       NaN
2  banglore        40.0       NaN
3  hydrabad        36.0       NaN
4     delhi         NaN      50.0
5    mumbai         NaN      55.0
6  banglore         NaN      42.0
7   chennai         NaN      70.0

In [43]:
pd.concat([temprature_df,humidity_df],axis=1)

       City  temprature      City  humidity
0    mumbai          32     delhi        50
1     delhi          45    mumbai        55
2  banglore          40  banglore        42
3  hydrabad          36   chennai        70

In [49]:
pd.merge(temprature_df,humidity_df,on='City',how='outer')

       City  temprature  humidity
0    mumbai        32.0      65.0
1     delhi        45.0      68.0
2  banglore        40.0      75.0
3  hydrabad        36.0       NaN
4   chennai         NaN      70.0

In [48]:
pd.merge(temprature_df,humidity_df,on="City",how="inner")

       City  temprature  humidity
0    mumbai          32        65
1     delhi          45        68
2  banglore          40        75

In [51]:
pd.merge(temprature_df,humidity_df,on="City",how="left")

       City  temprature  humidity
0    mumbai          32      65.0
1     delhi          45      68.0
2  banglore          40      75.0
3  hydrabad          36       NaN

In [52]:
pd.merge(temprature_df,humidity_df,on='City',how ='right')

       City  temprature  humidity
0     delhi        45.0        68
1    mumbai        32.0        65
2  banglore        40.0        75
3   chennai         NaN        70

In [54]:
df=pd.read_excel("C:\\Users\\Alok\OneDrive\Desktop\Full Stack Data Science\Shiva Rama krishna\Python For Data science\\liver.xlsx")
df

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [56]:
df=pd.read_csv("C:\\Users\\Alok\OneDrive\Desktop\Full Stack Data Science\Shiva Rama krishna\Python For Data science\\liver.csv")
df

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [59]:
df=pd.read_excel ("liver.xlsx")
df

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [61]:
df=pd.read_csv("liver.csv")
df

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [62]:
df.head()

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes

In [64]:
df.tail()

   Age  Gender   TB   DB   TP LiverPatient
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [65]:

df.shape

(10, 6)

In [66]:
df.size

60

In [67]:
df.columns

Index(['Age', 'Gender', 'TB', 'DB', 'TP', 'LiverPatient'], dtype='object')

In [69]:
df.keys()

Index(['Age', 'Gender', 'TB', 'DB', 'TP', 'LiverPatient'], dtype='object')

In [70]:
df.dtypes

Age               int64
Gender           object
TB              float64
DB              float64
TP              float64
LiverPatient     object
dtype: object

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Age           10 non-null     int64
 1   Gender        10 non-null     object
 2   TB            10 non-null     float64
 3   DB            10 non-null     float64
 4   TP            8 non-null      float64
 5   LiverPatient  10 non-null     object
dtypes: float64(3), int64(1), object(2)
memory usage: 608.0+ bytes

In [72]:
df.iloc[0]

Age                 65
Gender          Female
TB                 0.7
DB                 0.1
TP                 6.8
LiverPatient       Yes
Name: 0, dtype: object

In [73]:
df.iloc[-1]

Age               29
Gender          Male
TB               3.6
DB               0.1
TP               NaN
LiverPatient      No
Name: 9, dtype: object

In [74]:
df.iloc[[1,6]]

   Age  Gender   TB   DB   TP LiverPatient
1   62    Male  7.3  4.1  7.0          Yes
6   26  Female  0.9  0.2  4.5           No

In [75]:
df

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [76]:
df.iloc[[1,6]]

   Age  Gender   TB   DB   TP LiverPatient
1   62    Male  7.3  4.1  7.0          Yes
6   26  Female  0.9  0.2  4.5           No

In [77]:
df.iloc[2,1]

'Male'

In [80]:
df.iloc[[5,8],[0,1,2,3,4,5]]

   Age Gender   TB   DB   TP LiverPatient
5   46   Male  1.8  0.7  7.6          Yes
8   17   Male  0.9  0.3  5.4           No

In [81]:
df.iloc[[1,6]]

   Age  Gender   TB   DB   TP LiverPatient
1   62    Male  7.3  4.1  7.0          Yes
6   26  Female  0.9  0.2  4.5           No

In [82]:
df.iloc[[5,8],1:5]

  Gender   TB   DB   TP
5   Male  1.8  0.7  7.6
8   Male  0.9  0.3  5.4

In [83]:
df.iloc[0:3,0:2]

   Age  Gender
0   65  Female
1   62    Male
2   62    Male

In [87]:
df.loc[0]

Age                 65
Gender          Female
TB                 0.7
DB                 0.1
TP                 6.8
LiverPatient       Yes
Name: 0, dtype: object

In [90]:
df.loc[[2,3]]

   Age Gender   TB   DB   TP LiverPatient
2   62   Male  7.3  4.1  7.0          Yes
3   58   Male  1.0  0.4  6.8          Yes

In [91]:
df.loc[:,"Age"]

0    65
1    62
2    62
3    58
4    72
5    46
6    26
7    29
8    17
9    29
Name: Age, dtype: int64

In [92]:
df.iloc[:,0]

0    65
1    62
2    62
3    58
4    72
5    46
6    26
7    29
8    17
9    29
Name: Age, dtype: int64

In [93]:
df.loc[[2,3],'Age':"TP"]

   Age Gender   TB   DB   TP
2   62   Male  7.3  4.1  7.0
3   58   Male  1.0  0.4  6.8

In [94]:
df.iloc[[2,3],0:5]

   Age Gender   TB   DB   TP
2   62   Male  7.3  4.1  7.0
3   58   Male  1.0  0.4  6.8

In [95]:
df.iloc[2,0]

62

In [97]:
df.loc[2,"Age"]

62

In [98]:
df.iloc[0]

Age                 65
Gender          Female
TB                 0.7
DB                 0.1
TP                 6.8
LiverPatient       Yes
Name: 0, dtype: object

In [99]:
df.loc[:,"TB"]

0    0.7
1    7.3
2    7.3
3    1.0
4    3.9
5    1.8
6    0.9
7    4.5
8    0.9
9    3.6
Name: TB, dtype: float64

In [100]:
df.iloc[:,2]

0    0.7
1    7.3
2    7.3
3    1.0
4    3.9
5    1.8
6    0.9
7    4.5
8    0.9
9    3.6
Name: TB, dtype: float64

In [101]:
df.TB

0    0.7
1    7.3
2    7.3
3    1.0
4    3.9
5    1.8
6    0.9
7    4.5
8    0.9
9    3.6
Name: TB, dtype: float64

In [102]:
df['TB']

0    0.7
1    7.3
2    7.3
3    1.0
4    3.9
5    1.8
6    0.9
7    4.5
8    0.9
9    3.6
Name: TB, dtype: float64

In [103]:
df['TB'].values

array([0.7, 7.3, 7.3, 1. , 3.9, 1.8, 0.9, 4.5, 0.9, 3.6])

In [105]:
df.loc[:,["TB","DB"]]

    TB   DB
0  0.7  0.1
1  7.3  4.1
2  7.3  4.1
3  1.0  0.4
4  3.9  2.0
5  1.8  0.7
6  0.9  0.2
7  4.5  0.3
8  0.9  0.3
9  3.6  0.1

In [106]:
df.iloc[:[2,3]]

TypeError: cannot do positional indexing on RangeIndex with these indexers [[2, 3]] of type list